<!DOCTYPE html>
<html lang="th">
<head>
    <meta charset="UTF-8">
    <title>กิจกรรมในชั้นเรียนที่ 1</title>
</head>
<body>

    <h2>ข้อมูลส่วนตัวนักเรียน</h2>

    <?php
        $name = "สรวิชญ์ ศรีลาออน"; 
        $level = "มัธยมศึกษาปีที่ 6";
        $room = "ห้อง 8";
        $number = "11";
        $address = "43/474 ถนนพระรามที่ 2 แขวงบางมด เขตจอมทอง กรุงเทพฯ 10150";
        $education = "จบชั้นประถมศึกษาจากโรงเรียน วัดบางปะกอก, จบชั้นมัธยมศึกษาตอนต้นจากโรงเรียน บางปะกอกวิทยาคม";

        echo "ชื่อ-สกุล: " . $name . "<br>";
        echo "เรียนอยู่ระดับชั้น: " . $level . "<br>";
        echo "ห้องเรียน: " . $room . "<br>";
        echo "เลขที่: " . $number . "<br>";
        echo "ที่อยู่: " . $address . "<br>";
        echo "ประวัติการศึกษา: " . $education . "<br>";
    ?>

</body>
</html>
