<?php
$students = [
    "นายธนวินท์ ปัถวี", "นายปภังกร ลาภาศุภวัฒน์", "นายพรพิพัฒน์ ตั้งวิโรจน์กุล", 
    "นายภูมิฉัตร ปานทุ่ง", "นายไวภพ เพ็ญพันธ์นาค", "นายไอศูรย์ อนุศักดิ์ชัยกุล", 
    "นายวรท วงศ์คงสวัสดิ์", "นายบึงพิพัฒน์ บึงไกร", "นายพัทธนันท์ ประยูร", 
    "นายรุจิภาส แสงอ่อง", "นายสรวิชญ์ ศรีลาออน", "นายบุณยกร เฉลิมพรวิทิต", 
    "นายชิษณุพงศ์ ถํ้าบุญรัฐเศรษฐ์", "นายสรยุทธ บุตรวงค์", "นายฐตวรรณ พงษ์พยัคฆ์", 
    "นายจีรัชญ์ ขวัญแก้ว", "นายชยางกูร เชื้อเจริญ", "นายไชยพศ จัดเจนนาวี", 
    "นายปองคุณ อนุกิตติรัตน์", "นายศรัณยพงศ์ เอกอัครพรพล", "นายรวิพล ฤกษ์สมบูรณ์ดี", 
    "นายวิธวินท์ หอมอ่อน", "นายตรัยรัตน์ ประทีปคีรี", "นายธาวิน ลาภสมบัติศิริ", 
    "นายวีรภัฏ หุณฑะสิริ", "นายจิรายุ ชัยปรีชา", "นายเอกราช ลุนณี", 
    "นายสิรวิชญ์ ว่องกีรติกุล", "นายฐิติวัชร์ เลิศทักษิณานนท์", "นายเสฏพงศ์ สุวรรณวงศ์", 
    "นายภคินธ์ ไชยเดช", "น.ส.ภณิตา พึ่งใจ", "น.ส.กาญจนา คชศิลา", 
    "น.ส.พชรมน พลค้อ", "น.ส.ณัฐวิภา วงศ์ทองเครือ", "น.ส.ธิชานัน พลจอหอ", 
    "น.ส.นันทิชา มานํ้าเที่ยง", "น.ส.อิษฎาอร โชคมงคลเสถียร", "น.ส.พิมพ์มาดา เที่ยงสั้น", 
    "น.ส.สุวภัทร ปิงเมือง"
];

$myName = "นายสรวิชญ์ ศรีลาออน"; 
echo "รายชื่อนักเรียนห้อง 6/8 <br>";
echo "----------------------------------- <br>";
echo "เลขที่ 1 : " . $myName . " <br>";
$number = 2; 

for ($i = 0; $i < count($students); $i++) {
    
    if ($students[$i] != $myName) {
        echo "เลขที่ " . $number . " : " . $students[$i] . " <br>";
        
        $number++;
    }
}
?>
